-- 受講生情報を挿入
INSERT INTO students VALUES
('aaaaaaaa-0000-0000-0000-000000000101', '佐々木 真琴', 'ささき まこと', 'まこ', 'sasaki.makoto012@yahoo.co.jp', '東京都', 22, '男', '', false),
('aaaaaaaa-0000-0000-0000-000000000102', '中川 葵', 'なかがわ あおい', 'あお', 'aoi.nakagawa@outlook.com', '神奈川県', 20, '女', '', false),
('aaaaaaaa-0000-0000-0000-000000000103', '井上 悠人', 'いのうえ ゆうと', 'ゆう', 'yuto.inoue@gmail.com', '大阪府', 37, '男', '', false),
('aaaaaaaa-0000-0000-0000-000000000104', '吉田 楓', 'よしだ かえで', 'かえ', 'kaede_yoshida@icloud.com', '愛知県', 42, '女', '', false),
('aaaaaaaa-0000-0000-0000-000000000105', 'test name', 'test kananame', 'test nickname', 'test9999@test.com', 'Test', 99, 'その他', '備考テスト', true);

-- 受講生講座情報を挿入
INSERT INTO students_courses VALUES
('bbbbbbbb-0000-0000-0000-000000000201','aaaaaaaa-0000-0000-0000-000000000101','Javaコース','2024-01-15 09:00:00','2024-04-15 17:00:00'),
('bbbbbbbb-0000-0000-0000-000000000202','aaaaaaaa-0000-0000-0000-000000000102','AWSコース','2024-02-01 10:00:00','2024-05-01 18:00:00'),
('bbbbbbbb-0000-0000-0000-000000000203','aaaaaaaa-0000-0000-0000-000000000103','WordPressコース','2024-03-10 11:00:00','2024-06-10 16:00:00'),
('bbbbbbbb-0000-0000-0000-000000000204','aaaaaaaa-0000-0000-0000-000000000104','Javaコース','2024-04-01 09:00:00','2030-01-01 00:00:00'),
('bbbbbbbb-0000-0000-0000-000000000205','aaaaaaaa-0000-0000-0000-000000000105','AWSコース','2024-05-05 10:00:00','2030-01-01 00:00:00'),
('bbbbbbbb-0000-0000-0000-000000000206','aaaaaaaa-0000-0000-0000-000000000101','WordPressコース','2024-06-01 09:00:00','2024-09-01 17:00:00'),
('bbbbbbbb-0000-0000-0000-000000000207','aaaaaaaa-0000-0000-0000-000000000102','Javaコース','2024-07-10 09:00:00','2024-10-10 17:00:00'),
('bbbbbbbb-0000-0000-0000-000000000208','aaaaaaaa-0000-0000-0000-000000000103','AWSコース','2024-08-01 10:00:00',NULL);

